export const toCoachText = `
Alatech Center 僅提供運動紀錄資訊、日常生活追蹤紀錄或長時間的統計分析資料，使教練可觀察其學員運動與身體素質分析。不包含為接受提供身體疾病醫療相關之咨詢或建議。

於學員參與課程活動之前，必定確實清楚主動掌握學員是否有任何身體活動限制之生理 / 心理徵狀，或詢問學員之生理活動限制條件相關問題。

未能據實提供相關生理限制資訊，或刻意隱瞞，導致訓練過程發生身體不適，需要就醫接受醫療診治，Alatech無法為其負責。

當接受本聲明同時，加入您的課程學員將會建議往後運動或報告紀錄的隱私權設定值，並其隱私權設定修改為"我的教練"。爾後其學員可在個人資訊的隱私權上修改該設定值，或退出課程解除教練與學員關係。
`;

export const toMemberText = `
Alatech Center 僅提供運動紀錄資訊、日常生活追蹤紀錄或長時間的統計分析資料，使教練與其學員交流運動與身體素質分析。。不包含為接受提供身體疾病醫療相關之咨詢或建議。

於參與教練課程活動之前，必定確實清楚主動告知是否有任何身體活動限制之生理 / 心理徵狀，或據實回答教練詢問之生理活動限制條件相關問題。

未能據實提供相關生理限制資訊，或刻意隱瞞，導致訓練過程發生身體不適，需要就醫接受醫療診治，Alatech無法為其負責。

當接受本聲明同時，將會更改往後運動或報告紀錄的隱私權設定值，並其隱私權設定修改為"我的教練"。爾後您可在個人資訊的隱私權上修改該設定值，或退出課程解
除教練與學員關係。
`;
